In [1]:
# Run this cell
from datascience import *
import numpy as np

## Review of Tables ##

In [2]:
# Load Table. Don't worry about code yet. 
skyscrapers = Table.read_table('skyscrapers.csv')
skyscrapers

name                              | material  | city          | height | completed
One World Trade Center            | composite | New York City | 541.3  | 2014
Willis Tower                      | steel     | Chicago       | 442.14 | 1974
432 Park Avenue                   | concrete  | New York City | 425.5  | 2015
Trump International Hotel & Tower | concrete  | Chicago       | 423.22 | 2009
Empire State Building             | steel     | New York City | 381    | 1931
Bank of America Tower             | composite | New York City | 365.8  | 2009
Stratosphere Tower                | concrete  | Las Vegas     | 350.22 | 1996
Aon Center                        | steel     | Chicago       | 346.26 | 1973
John Hancock Center               | steel     | Chicago       | 343.69 | 1969
WITI TV Tower                     | steel     | Shorewood     | 329    | 1962
... (190 rows omitted)

In [3]:
#Remember select allows us to make a new table with only selected columns
#Select name and height
skyscrapers.select('name', 'height')

name                              | height
One World Trade Center            | 541.3
Willis Tower                      | 442.14
432 Park Avenue                   | 425.5
Trump International Hotel & Tower | 423.22
Empire State Building             | 381
Bank of America Tower             | 365.8
Stratosphere Tower                | 350.22
Aon Center                        | 346.26
John Hancock Center               | 343.69
WITI TV Tower                     | 329
... (190 rows omitted)

In [4]:
#Similarly, drop allows us to drop columns that have been selected
skyscrapers.drop('completed', 'height', 'material')

name                              | city
One World Trade Center            | New York City
Willis Tower                      | Chicago
432 Park Avenue                   | New York City
Trump International Hotel & Tower | Chicago
Empire State Building             | New York City
Bank of America Tower             | New York City
Stratosphere Tower                | Las Vegas
Aon Center                        | Chicago
John Hancock Center               | Chicago
WITI TV Tower                     | Shorewood
... (190 rows omitted)

In [5]:
#Since we did not save the new tables to a name we still have the original table 
skyscrapers

name                              | material  | city          | height | completed
One World Trade Center            | composite | New York City | 541.3  | 2014
Willis Tower                      | steel     | Chicago       | 442.14 | 1974
432 Park Avenue                   | concrete  | New York City | 425.5  | 2015
Trump International Hotel & Tower | concrete  | Chicago       | 423.22 | 2009
Empire State Building             | steel     | New York City | 381    | 1931
Bank of America Tower             | composite | New York City | 365.8  | 2009
Stratosphere Tower                | concrete  | Las Vegas     | 350.22 | 1996
Aon Center                        | steel     | Chicago       | 346.26 | 1973
John Hancock Center               | steel     | Chicago       | 343.69 | 1969
WITI TV Tower                     | steel     | Shorewood     | 329    | 1962
... (190 rows omitted)

In [6]:
# Find all the sky scrappers in Chicago
skyscrapers.where('city', 'Los Angeles')

name                  | material | city        | height | completed
U.S. Bank Tower       | steel    | Los Angeles | 310.29 | 1990
Aon Center            | steel    | Los Angeles | 261.52 | 1974
Two California Plaza  | steel    | Los Angeles | 228.6  | 1992
Gas Company Tower     | steel    | Los Angeles | 228.3  | 1991
Bank of America Plaza | steel    | Los Angeles | 224.03 | 1975
777 Tower             | steel    | Los Angeles | 221    | 1991
Wells Fargo Tower     | steel    | Los Angeles | 220.37 | 1983
Figueroa at Wilshire  | steel    | Los Angeles | 218.54 | 1989
City National Tower   | steel    | Los Angeles | 213.06 | 1971
Paul Hastings Tower   | steel    | Los Angeles | 213.06 | 1971
... (1 rows omitted)

In [7]:
# Depending on the condition we must change columns to change attributes that are filtered
# for example how would you make a table that contains skyscrappers that ar made of steel 
skyscrapers.where('name', 'Empire State Building')

name                  | material | city          | height | completed
Empire State Building | steel    | New York City | 381    | 1931

In [8]:
#Finally let's find the skyscrappers that are in Chicago and sort by when they 
#were completed
skyscrapers.where('city', 'New York City').sort('completed')

name                    | material | city          | height | completed
Metropolitan Life Tower | steel    | New York City | 213.36 | 1909
Woolworth Building      | steel    | New York City | 241.4  | 1913
Chanin Building         | steel    | New York City | 197.8  | 1929
Mercantile Building     | steel    | New York City | 192.6  | 1929
Chrysler Building       | steel    | New York City | 318.9  | 1930
The Trump Building      | steel    | New York City | 282.55 | 1930
One Grand Central Place | steel    | New York City | 205.13 | 1930
Empire State Building   | steel    | New York City | 381    | 1931
Twenty Exchange         | steel    | New York City | 225.86 | 1931
500 Fifth Avenue        | steel    | New York City | 212.45 | 1931
... (63 rows omitted)

## Numbers ##

In [ ]:
20  # int

In [ ]:
20 / 3  # float

In [ ]:
20 / 2  # also a float

In [1]:
# Is the following an int or a flpat
1234 ** 5

2861381721051424

In [5]:
# Integers in python are allowed to be of dynamic length
# Integers can more or less grow as long as you need
data = 123456789 ** 1234
data

33170

In [6]:
# On the other hand floating point numbers can only handle decimal places up to 18 sig figs
4 / 700

0.005714285714285714

In [7]:
4 / 700000000000000000

5.714285714285714e-18

In [8]:
#
0.12345678901234567890123456789

0.12345678901234568

In [9]:
# If you use more then 18 sig figs then pyton will produce operator error
# Small rounding errors are often confusing when first encountered.

0.12345678901234567890123456789 - 0.1234567890123456789

0.0

In [10]:
# combining float values with arithmetic, the last few digits may be incorrect.
# For example if we take the square root of 10 we get float representation
# if we then square it, we get our orginal number with a  small error
10 ** 0.5

3.1622776601683795

In [12]:
(10 ** 0.5) ** 2

10.000000000000002

In [13]:
# We can convert a float to an integer using the int function
20 / 10

2.0

In [14]:
# int takes a floating point number and returns the int
int(20 / 10)

2

In [15]:
# Caution. If you typecase a float that has a non empty decimal place, this information is lost. 
# changing the value
int(20 / 9)

2

In [16]:
# We can convert from an integer to a float 
# This never loses information! 
float(3)

3.0

## Strings ##

In [ ]:
# An example of a string
'baby yoda'

In [ ]:
# An example with ""
"baby yoda isn't yoda"

In [ ]:
# An example with '' and a ' which causes an error
'baby yoda isn't yoda'

In [ ]:
# We can add two strings together
'straw' + 'berry' # concatenation

In [ ]:
#String concation is literal. Meaning it glues each string consequentively to the previous one 
'straw' + ' ' + 'berry'

In [23]:
#Strings are objects with special functions like tables 
#For example we can change a letters to uppercase with stringname.upper()
'ha'.upper()

'HA'

In [24]:
#Another special function that only works on strings is replace. It
# takes a indicated substring and replaces it with a string of your choice

'hllogvna'.replace('gvna','governer')

'hllogoverner'

In [25]:
#Rember these special functions can also work on names of the strings
make = 'a string of something'
make.upper()

'A STRING OF SOMETHING'

In [ ]:
# We are can convert an integer represented as a string using int.
# It must be an int or we get an error
int('3')

In [ ]:
# We can do these same for a float that is represented as a string using float
float('3.0')

In [ ]:
#In the other direction we can convert any numerical value into a string 
str(3)

In [ ]:
str(4.5)

In [ ]:
#
#Ints and Floats can be used to do operations like additon and subtraction
#

#
#Strings can cancatenate with other strings
#

#
#But operations between strings and numerical values will cause errors! 
#


## Types ##

In [ ]:
#Lets try out type
# what is the type of 10
type(10)

In [ ]:
# what is the type of a = 10
a = 10
type(a)

In [ ]:
what is the type of 4.6
type(4.5)

In [ ]:
type('abc')

In [ ]:
# what is the type of skyscrapers?
type(skyscrapers)

In [ ]:
# what about abs value function 
type(True)

In [ ]:
type(abs)

## Comparisions

In [1]:
# We can compare numbers, just like normal math

12 < 10

False

In [2]:
55>= 5

True

In [3]:
# Its possible to check whether two strings are equal

'bananas' == 'apple'

False

In [4]:
#At times its also useful to check whether two strings are not equal

'bananas' != 'apple'

True

In [12]:
# Strings can also be compared, and their order is alphabetical. 
#A shorter string is less than a longer string that begins with the shorter string.
'bananas' > 'apple'

True

## Arrays ##

In [ ]:
my_array = make_array(1, 2, 3, 4)

In [ ]:
my_array

In [ ]:
my_array * 2

In [ ]:
my_array ** 2

In [ ]:
my_array + 1

In [ ]:
my_array # array is unchanged

In [ ]:
len(my_array)

In [ ]:
sum(my_array)

In [ ]:
len(my_array) / sum(my_array)

In [ ]:
another = make_array(60, 70, 80, 90)

In [ ]:
my_array + another

In [ ]:
yet_another = make_array(5, 6, 7)

In [ ]:
my_array + yet_another

In [ ]:
tunas = make_array('bluefin', 'albacore', 'jim')
tunas

In [ ]:
sum(my_array)

In [ ]:
np.average(my_array)

In [ ]:
len(my_array)

## Columns of Tables are Arrays ##

In [ ]:
sf = skyscrapers.where('city', 'San Francisco')
sf

In [ ]:
sf.select('height')

In [ ]:
sf.column('height')

In [ ]:
np.average(sf.column('height'))